Checking out license 'RTL_Compiler_Ultra'... (0 seconds elapsed)

                       Cadence Encounter(R) RTL Compiler
               Version v07.10-s016_1 (32-bit), built Sep 13 2007



================================================================================
              Welcome to Encounter (TM) Encounter(R) RTL Compiler

Here is a quick introduction on how to access our product information.  
If you do not want this message to appear in the future, create an 
initialization file (an empty file will do) in your home directory 
called '~/.cadence/.synth_init'.

  To access the product documentation in HTML and PDF, type 'cdnshelp'
    at the system prompt. 
  For a list of available commands, type 'help'. 
  To view a man page for a command, type 'man <commandName>'.
  To view a man page for an error message, type 'man <messageID>'.
  For a list of all possible object types, type 'get_attribute -help'.
  For a list of all available attributes by object type, type
    'get_attribute * <object_type> -help'.
  For a list of all attributes for every object type, type
    'get_attribute * * -help'
  To list only writable attributes, substitute 'get_attribute' with
    'set_attribute'.
  To get a template script to run RTL Compiler, use the 'write_template'
    command.
  To get a template script to run Conformal based on the current RTL
    Compiler session, use the 'write_do_lec' command.
  
  Obsolete attributes in the current tool version.
  To learn more, type 'get_attribute -help <attribute> <object>'.

      object  attribute
      ------  ---------
    instance  black_box
    instance  dft_inherited_dont_scan
    instance  write_positional_connections
         net  logic0_driven
         net  logic1_driven
        root  area_per_unit_length
        root  bit_blast_constants
        root  bit_blast_mapped_ports
        root  capacitance_per_unit_length
        root  degenerate_complex_seqs
        root  exact_match_seqs_async_controls
        root  gen_no_negative_index
        root  gen_unconnected_port_style
        root  gen_write_empty_module_for_logic_abstract
        root  hdl_array_generator
        root  hdl_flatten_array
        root  hdl_old_reg_naming
        root  hdl_record_generator
        root  hdl_reg_naming_style_scalar
        root  hdl_reg_naming_style_vector
        root  hdl_vector_naming_style
        root  pqos_virtual_buffer
        root  resistance_per_unit_length

Send us feedback at rc_feedback@cadence.com.
================================================================================

rc:/> set_attribute hdl_search_path /home/bmahesh/Downloads/approx
  Setting attribute of root '/': 'hdl_search_path' = /home/bmahesh/Downloads/approx
rc:/> set_attribute library /ad/eng/courses/ec/ec772/Spring2011/Nangate/NangateOpenCellLibrary_PDKv1_3_v2009_07/liberty/NangateOpenCellLibrary_typical_conditional_ccs.lib
  Setting attribute of root '/': 'library' = /ad/eng/courses/ec/ec772/Spring2011/Nangate/NangateOpenCellLibrary_PDKv1_3_v2009_07/liberty/NangateOpenCellLibrary_typical_conditional_ccs.lib
rc:/> read approx_mul.v
can not find channel named "approx_mul.v"
rc:/> read_hdl approx_mul.v
rc:/> elaborate
Warning : Non-monotonic wireload model found. [LBR-81]
        : 'Length' table in wireload model '3K_hvratio_1_2' is non-monotonic.
        : Non-monotonic wireload models can cause problems during synthesis and/or mapping.  Raising some of the points in the curve to give it a monotonic shape.
Warning : Non-monotonic wireload model found. [LBR-81]
        : 'Length' table in wireload model '3K_hvratio_1_2' is non-monotonic.
Warning : Non-monotonic wireload model found. [LBR-81]
        : 'Length' table in wireload model '3K_hvratio_1_2' is non-monotonic.
  Elaborating top-level block 'approx_mul' from file '/home/bmahesh/Downloads/approx/approx_mul.v'.
Warning : Removing unused register. [CDFG-508]
        : Removing unused register 'shifta' in module 'approx_mul' in file '/home/bmahesh/Downloads/approx/approx_mul.v' on line 168.
        : A flip-flop or latch that was inferred for an unused signal or variable was removed. Use 'set_attribute hdl_preserve_unused_registers true /' to preserve the flip-flop or latch.
Warning : Removing unused register. [CDFG-508]
        : Removing unused register 'shiftb' in module 'approx_mul' in file '/home/bmahesh/Downloads/approx/approx_mul.v' on line 168.
Warning : Variable or signal is driven in more than one process or block; this may cause simulation mismatches between the original and synthesized designs. [CDFG2G-622]
        : 'out_B' in module 'approx_mul' in file '/home/bmahesh/Downloads/approx/approx_mul.v' on line 24, column 27.
        : There are multiple drivers to the net or register.
Warning : Variable or signal is driven in more than one process or block; this may cause simulation mismatches between the original and synthesized designs. [CDFG2G-622]
        : 'out_A' in module 'approx_mul' in file '/home/bmahesh/Downloads/approx/approx_mul.v' on line 24, column 20.
  Done elaborating 'approx_mul'.
rc:/> check_design
  Checking the design.

 	 Check Design Report
	 -------------------- 

 Summary
 ------- 

              Name              Total 
--------------------------------------
Unresolved References               0 
Empty Modules                       0 
Unloaded Port(s)                    1 
Unloaded Sequential Pin(s)          0 
Assigns                             0 
Undriven Port(s)                    0 
Undriven Leaf Pin(s)                0 
Undriven hierarchical pin(s)        0 
Multidriven Port(s)                32 
Multidriven Leaf Pin(s)             0 
Multidriven hierarchical Pin(s)     0 
Constant Port(s)                    0 
Constant Leaf Pin(s)                0 
Constant hierarchical Pin(s)       12 

  Done Checking the design.
rc:/> set clk_input [define_clock -period 1500 -name clk_input clk]
/designs/approx_mul/timing/clock_domains/domain_1/clk_input
rc:/> external_delay -input 10 -clock $clk_input -name in_con [find /des* -port ports_in/*]
/designs/approx_mul/timing/external_delays/in_con
rc:/> external_delay -output 10 -clock $clk_input -name out_con [find /des* -port ports_out/*]
/designs/approx_mul/timing/external_delays/out_con
rc:/> synthesize -to_mapped
Mapping approx_mul to gates.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[0]'.
        : This optimization was enabled by the root attribute 'optimize_constant_0_flops'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[0]102'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[10]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[11]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[12]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[13]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[14]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[15]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[1]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[1]104'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[2]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[2]106'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[3]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[3]108'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[4]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[4]110'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[5]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[5]112'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[6]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[7]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[8]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_A_reg[9]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[0]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[0]132'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[10]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[11]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[12]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[13]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[14]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[15]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[1]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[1]134'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[2]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[2]136'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[3]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[3]138'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[4]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[4]140'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[5]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[5]142'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[6]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[7]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[8]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'out_B_reg[9]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'shift_B_reg[4]'.
Info    : Replacing a flip-flop with a logic constant 0. [GLO-12]
        : The instance is 'shift_A_reg[4]'.
Deleting 46 sequential instances.  They do not transitively
  drive any primary outputs.
 
Global mapping target info
==========================
Cost Group 'default' target slack:    43 ps
Target path end-point (Pin: shift_b_reg[3]/d)

 
Global mapping status
=====================
                         Worst  
                 Total    Neg   
Operation         Area   Slack  Worst Path
-------------------------------------------------------------------------------
 global_map        314       0  N/A
 fine_map          314       0  N/A
 area_map          314       0  N/A
 area_map          314       0  N/A
 area_map          314       0  N/A
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        314       0         0        0
 init_drc          314       0         0        0
 init_area         314       0         0        0
 rem_buf           313       0         0        0
 merge_bi          311       0         0        0
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        311       0         0        0
 init_drc          311       0         0        0
 init_area         311       0         0        0

  Done mapping approx_mul
  Synthesis succeeded.
rc:/> set clk_input [define_clock -period 500 -name clk_input clk]
Warning : Replacing existing clock definition. [TIM-101]
        : The clock name is 'clk_input'
        : A new clock has been defined with the same name as an existing clock.
/designs/approx_mul/timing/clock_domains/domain_1/clk_input
rc:/> external_delay -input 10 -clock $clk_input -name in_con [find /des* -port ports_in/*]
  Replacing existing external delay 'in_con'.
/designs/approx_mul/timing/external_delays/in_con
rc:/> external_delay -output 10 -clock $clk_input -name out_con [find /des* -port ports_out/*]
  Replacing existing external delay 'out_con'.
/designs/approx_mul/timing/external_delays/out_con
rc:/> synthesize -to_mapped
Mapping approx_mul to gates.
 
Global mapping target info
==========================
Cost Group 'default' target slack:    13 ps
Target path end-point (Pin: shift_A_reg[1]/d)

 
Global mapping status
=====================
                         Worst  
                 Total    Neg   
Operation         Area   Slack  Worst Path
-------------------------------------------------------------------------------
 global_map        316       0  N/A
 fine_map          316       0  N/A
 area_map          316       0  N/A
 area_map          316       0  N/A
 area_map          316       0  N/A
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        316       0         0        0
 init_drc          316       0         0        0
 init_area         316       0         0        0
 merge_bi          308       0         0        0
 rem_inv_qb        303       0         0        0
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        303       0         0        0
 init_drc          303       0         0        0
 init_area         303       0         0        0

  Done mapping approx_mul
  Synthesis succeeded.
rc:/> set clk_input [define_clock -period 200 -name clk_input clk]
Warning : Replacing existing clock definition. [TIM-101]
        : The clock name is 'clk_input'
/designs/approx_mul/timing/clock_domains/domain_1/clk_input
rc:/> external_delay -input 10 -clock $clk_input -name in_con [find /des* -port ports_in/*]
  Replacing existing external delay 'in_con'.
/designs/approx_mul/timing/external_delays/in_con
rc:/> external_delay -output 10 -clock $clk_input -name out_con [find /des* -port ports_out/*]
  Replacing existing external delay 'out_con'.
/designs/approx_mul/timing/external_delays/out_con
rc:/> synthesize -to_mapped
Mapping approx_mul to gates.
 
Global mapping target info
==========================
Cost Group 'default' target slack:   -23 ps
Target path end-point (Pin: shift_A_reg[2]/d)

 
Global mapping status
=====================
                         Worst  
                 Total    Neg   
Operation         Area   Slack  Worst Path
-------------------------------------------------------------------------------
 global_map        386     -36  in_b[13] --> shift_B_reg[1]/D
 fine_map          371     -34  in_b[5] --> shift_B_reg[0]/D
 area_map          373     -32  in_b[4] --> shift_B_reg[2]/D
 area_map          374     -32  in_b[4] --> shift_B_reg[2]/D
 area_map          376     -31  in_b[4] --> shift_B_reg[2]/D
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        376     -31         0        0
            Path: in_b[4] --> shift_B_reg[2]/D
 incr_delay        379     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 init_drc          379     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 init_area         379     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 rem_buf           378     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 rem_inv           377     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 merge_bi          373     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 rem_inv_qb        360     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 glob_area         360     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 area_down         359     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        359     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 incr_delay        360     -28         0        0
            Path: in_b[13] --> shift_B_reg[2]/D
 incr_delay        359     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 init_drc          359     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 init_area         359     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 glob_area         359     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D
 area_down         358     -28         0        0
            Path: in_b[13] --> shift_B_reg[1]/D

  Done mapping approx_mul
  Synthesis succeeded.
rc:/> set clk_input [define_clock -period 230 -name clk_input clk]
Warning : Replacing existing clock definition. [TIM-101]
        : The clock name is 'clk_input'
/designs/approx_mul/timing/clock_domains/domain_1/clk_input
rc:/> external_delay -input 10 -clock $clk_input -name in_con [find /des* -port ports_in/*]
  Replacing existing external delay 'in_con'.
/designs/approx_mul/timing/external_delays/in_con
rc:/> external_delay -output 10 -clock $clk_input -name out_con [find /des* -port ports_out/*]
  Replacing existing external delay 'out_con'.
/designs/approx_mul/timing/external_delays/out_con
rc:/> synthesize -to_mapped
Mapping approx_mul to gates.
 
Global mapping target info
==========================
Cost Group 'default' target slack:     5 ps
Target path end-point (Pin: shift_A_reg[2]/d)

 
Global mapping status
=====================
                         Worst  
                 Total    Neg   
Operation         Area   Slack  Worst Path
-------------------------------------------------------------------------------
 global_map        392     -14  in_b[7] --> shift_b_reg[1]/D
 fine_map          374      -9  in_b[11] --> shift_B_reg[2]/D
 area_map          374      -9  in_b[11] --> shift_B_reg[2]/D
 area_map          374      -9  in_b[11] --> shift_B_reg[2]/D
 area_map          374      -9  in_b[11] --> shift_B_reg[2]/D
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        374      -9         0        0
            Path: in_b[11] --> shift_B_reg[2]/D
 incr_delay        381      -2         0        0
            Path: in_b[11] --> shift_B_reg[2]/D
 incr_delay        383       0         0        0
            Path: in_b[11] --> shift_B_reg[2]/D
 incr_delay        383       0         0        0
            Path: in_a[4] --> shift_A_reg[0]/D
 incr_delay        384       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 init_drc          384       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 init_area         384       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 rem_buf           381       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 merge_bi          374       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 rem_inv_qb        362       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 glob_area         360       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 
Incremental optimization status
===============================
                         Worst  - - DRC Totals - - 
                 Total    Neg       Max       Max 
Operation         Area   Slack     Trans      Cap 
-------------------------------------------------------------------------------
 init_delay        360       0         0        0
            Path: in_b[7] --> shift_B_reg[2]/D
 incr_delay        360       0         0        0
 init_drc          360       0         0        0
 init_area         360       0         0        0

  Done mapping approx_mul
  Synthesis succeeded.
rc:/> 